In [40]:
import numpy as np
import pandas as pd

In [41]:
perros=np.array([['Bella','Labrador','Café',56,24,'2013-07-01'],
                 ['Charlie','Poodle','Negro',43,24,'2016-09-16'],
                 ['Lucy','Chow chow','Café',46,24,'2014-08-25'],
                 ['Cooper','Schnauzer','Gris',49,17,'2011-12-11'],
                 ['Bernie','San Bernando','Blanco',77,74,'2018-02-27'],
                 ['Max','Chow chow','Blanco',45,28,'2019-03-27'],
                 ['Reed','Schnauzer','Negro',45,15,'2017-09-18']])
perros

array([['Bella', 'Labrador', 'Café', '56', '24', '2013-07-01'],
       ['Charlie', 'Poodle', 'Negro', '43', '24', '2016-09-16'],
       ['Lucy', 'Chow chow', 'Café', '46', '24', '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gris', '49', '17', '2011-12-11'],
       ['Bernie', 'San Bernando', 'Blanco', '77', '74', '2018-02-27'],
       ['Max', 'Chow chow', 'Blanco', '45', '28', '2019-03-27'],
       ['Reed', 'Schnauzer', 'Negro', '45', '15', '2017-09-18']],
      dtype='<U12')

In [42]:
df=pd.DataFrame(data=perros, columns=['Nombre','Raza','Color','Altura_cm','Peso_kg','Fecha_nac'])
df['Altura_cm']=df['Altura_cm'].astype(int)
df['Peso_kg']=df['Peso_kg'].astype(int)
df

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_nac
0    Bella      Labrador    Café         56       24  2013-07-01
1  Charlie        Poodle   Negro         43       24  2016-09-16
2     Lucy     Chow chow    Café         46       24  2014-08-25
3   Cooper     Schnauzer    Gris         49       17  2011-12-11
4   Bernie  San Bernando  Blanco         77       74  2018-02-27
5      Max     Chow chow  Blanco         45       28  2019-03-27
6     Reed     Schnauzer   Negro         45       15  2017-09-18

In [43]:
# calculo de la media
df['Peso_kg'].mean()

29.428571428571427

In [44]:
df['Fecha_nac'].min()

'2011-12-11'

In [45]:
# Funcion de agregacion estaditica
def percentil80(columna):
    return columna.quantile(0.80)

df['Altura_cm'].agg(percentil80)

54.60000000000001

In [46]:
df[['Altura_cm','Peso_kg']].agg(percentil80)

Altura_cm    54.6
Peso_kg      27.2
dtype: float64

In [47]:
def percentil90(columna):
    return columna.quantile(0.90)

df['Altura_cm'].agg([percentil80,percentil90])

percentil80    54.6
percentil90    64.4
Name: Altura_cm, dtype: float64

In [48]:
df['Altura_cm']

0    56
1    43
2    46
3    49
4    77
5    45
6    45
Name: Altura_cm, dtype: int32

In [49]:
df['Altura_cm'].cumsum()

0     56
1     99
2    145
3    194
4    271
5    316
6    361
Name: Altura_cm, dtype: int32

In [50]:
df['Altura_cm'].cummin()

0    56
1    43
2    43
3    43
4    43
5    43
6    43
Name: Altura_cm, dtype: int32

In [51]:
df['Raza'].value_counts()

Raza
Chow chow       2
Schnauzer       2
Labrador        1
Poodle          1
San Bernando    1
Name: count, dtype: int64

In [52]:
df['Raza'].value_counts(normalize=True)

Raza
Chow chow       0.285714
Schnauzer       0.285714
Labrador        0.142857
Poodle          0.142857
San Bernando    0.142857
Name: proportion, dtype: float64

In [53]:
# resumir por grupo: mejor opcion
df.groupby('Color')['Peso_kg'].mean()

Color
Blanco    51.0
Café      24.0
Gris      17.0
Negro     19.5
Name: Peso_kg, dtype: float64

In [54]:
# resumen colores y peso

df.groupby('Color')['Peso_kg'].agg([min,max,sum])

C:\Users\benma\AppData\Local\Temp\ipykernel_5684\3345005457.py:3: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('Color')['Peso_kg'].agg([min,max,sum])
C:\Users\benma\AppData\Local\Temp\ipykernel_5684\3345005457.py:3: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('Color')['Peso_kg'].agg([min,max,sum])
C:\Users\benma\AppData\Local\Temp\ipykernel_5684\3345005457.py:3: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.groupby('Color')['Peso_kg'].agg([min,max,sum])

        min  max  sum
Color
Blanco   28   74  102
Café     24   24   48
Gris     17   17   17
Negro    15   24   39

In [55]:
df.groupby(['Color','Raza'])['Peso_kg'].mean()

Color   Raza
Blanco  Chow chow       28.0
        San Bernando    74.0
Café    Chow chow       24.0
        Labrador        24.0
Gris    Schnauzer       17.0
Negro   Poodle          24.0
        Schnauzer       15.0
Name: Peso_kg, dtype: float64

In [56]:
# uso de tablas pivote
df.pivot_table(values='Peso_kg',index='Color',columns='Raza',fill_value= "-")

Raza   Chow chow Labrador Poodle San Bernando Schnauzer
Color
Blanco      28.0        -      -         74.0         -
Café        24.0     24.0      -            -         -
Gris           -        -      -            -      17.0
Negro          -        -   24.0            -      15.0

In [57]:
df.pivot_table(values='Peso_kg',index='Color',columns='Raza',fill_value= "-",margins=True,aggfunc=np.mean)

C:\Users\benma\AppData\Local\Temp\ipykernel_5684\2945376484.py:1: FutureWarning: The provided callable <function mean at 0x000002618C0AA340> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  df.pivot_table(values='Peso_kg',index='Color',columns='Raza',fill_value= "-",margins=True,aggfunc=np.mean)
C:\Users\benma\AppData\Local\Temp\ipykernel_5684\2945376484.py:1: FutureWarning: The provided callable <function mean at 0x000002618C0AA340> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  df.pivot_table(values='Peso_kg',index='Color',columns='Raza',fill_value= "-",margins=True,aggfunc=np.mean)
C:\Users\benma\AppData\Local\Temp\ipykernel_5684\2945376484.py:1: FutureWarning: The provided callable <function mean at 0x000002618C0AA340> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  df.pivot_table(values='Peso_kg',index='Color',columns='Raza',fill_value= "-",margins=True,aggfunc=np.mean)

Raza   Chow chow Labrador Poodle San Bernando Schnauzer        All
Color
Blanco      28.0        -      -         74.0         -       51.0
Café        24.0     24.0      -            -         -       24.0
Gris           -        -      -            -      17.0       17.0
Negro          -        -   24.0            -      15.0       19.5
All         26.0     24.0   24.0         74.0      16.0  29.428571

In [58]:
df.columns

Index(['Nombre', 'Raza', 'Color', 'Altura_cm', 'Peso_kg', 'Fecha_nac'], dtype='object')

In [59]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [60]:
df_index=df.set_index('Nombre')
df_index

                 Raza   Color  Altura_cm  Peso_kg   Fecha_nac
Nombre
Bella        Labrador    Café         56       24  2013-07-01
Charlie        Poodle   Negro         43       24  2016-09-16
Lucy        Chow chow    Café         46       24  2014-08-25
Cooper      Schnauzer    Gris         49       17  2011-12-11
Bernie   San Bernando  Blanco         77       74  2018-02-27
Max         Chow chow  Blanco         45       28  2019-03-27
Reed        Schnauzer   Negro         45       15  2017-09-18

In [61]:
df_ind=df_index.reset_index()
df_ind

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_nac
0    Bella      Labrador    Café         56       24  2013-07-01
1  Charlie        Poodle   Negro         43       24  2016-09-16
2     Lucy     Chow chow    Café         46       24  2014-08-25
3   Cooper     Schnauzer    Gris         49       17  2011-12-11
4   Bernie  San Bernando  Blanco         77       74  2018-02-27
5      Max     Chow chow  Blanco         45       28  2019-03-27
6     Reed     Schnauzer   Negro         45       15  2017-09-18

In [62]:
# eliminar un indice y su columna
df_ind = df.set_index("Nombre")
df_ind = df_ind.reset_index(drop=True)
df_ind

           Raza   Color  Altura_cm  Peso_kg   Fecha_nac
0      Labrador    Café         56       24  2013-07-01
1        Poodle   Negro         43       24  2016-09-16
2     Chow chow    Café         46       24  2014-08-25
3     Schnauzer    Gris         49       17  2011-12-11
4  San Bernando  Blanco         77       74  2018-02-27
5     Chow chow  Blanco         45       28  2019-03-27
6     Schnauzer   Negro         45       15  2017-09-18

In [63]:
# buscar valores por indice opcion 1
# busqueda de nombre en base original
df[df['Nombre'].isin(['Bella','Charlie'])]

    Nombre      Raza  Color  Altura_cm  Peso_kg   Fecha_nac
0    Bella  Labrador   Café         56       24  2013-07-01
1  Charlie    Poodle  Negro         43       24  2016-09-16

In [64]:
# buscar valores por indice opcion 2
df_ind=df.set_index('Nombre')
df_ind.loc[['Bella','Charlie']]

             Raza  Color  Altura_cm  Peso_kg   Fecha_nac
Nombre
Bella    Labrador   Café         56       24  2013-07-01
Charlie    Poodle  Negro         43       24  2016-09-16

In [65]:
df_ind2=df.set_index(['Raza','Color'])
df_ind2

                      Nombre  Altura_cm  Peso_kg   Fecha_nac
Raza         Color
Labrador     Café      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
Chow chow    Café       Lucy         46       24  2014-08-25
Schnauzer    Gris     Cooper         49       17  2011-12-11
San Bernando Blanco   Bernie         77       74  2018-02-27
Chow chow    Blanco      Max         45       28  2019-03-27
Schnauzer    Negro      Reed         45       15  2017-09-18

In [66]:
df_ind2.loc[['Chow chow','Poodle']]

                   Nombre  Altura_cm  Peso_kg   Fecha_nac
Raza      Color
Chow chow Café       Lucy         46       24  2014-08-25
          Blanco      Max         45       28  2019-03-27
Poodle    Negro   Charlie         43       24  2016-09-16

In [70]:
# consultando por caracteristicas (tuplas)
df_ind2.loc[[('Schnauzer','Gris'), ('Poodle','Negro')]]

                  Nombre  Altura_cm  Peso_kg   Fecha_nac
Raza      Color
Schnauzer Gris    Cooper         49       17  2011-12-11
Poodle    Negro  Charlie         43       24  2016-09-16

In [71]:
# Ordenamiento por primer indice de referencia
df_ind2.sort_index()

                      Nombre  Altura_cm  Peso_kg   Fecha_nac
Raza         Color
Chow chow    Blanco      Max         45       28  2019-03-27
             Café       Lucy         46       24  2014-08-25
Labrador     Café      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
San Bernando Blanco   Bernie         77       74  2018-02-27
Schnauzer    Gris     Cooper         49       17  2011-12-11
             Negro      Reed         45       15  2017-09-18

In [72]:
df_ind2.sort_index(level=('Color','Raza'), ascending=(True,False))

                      Nombre  Altura_cm  Peso_kg   Fecha_nac
Raza         Color
San Bernando Blanco   Bernie         77       74  2018-02-27
Chow chow    Blanco      Max         45       28  2019-03-27
Labrador     Café      Bella         56       24  2013-07-01
Chow chow    Café       Lucy         46       24  2014-08-25
Schnauzer    Gris     Cooper         49       17  2011-12-11
             Negro      Reed         45       15  2017-09-18
Poodle       Negro   Charlie         43       24  2016-09-16

In [74]:
df[:3]

    Nombre       Raza  Color  Altura_cm  Peso_kg   Fecha_nac
0    Bella   Labrador   Café         56       24  2013-07-01
1  Charlie     Poodle  Negro         43       24  2016-09-16
2     Lucy  Chow chow   Café         46       24  2014-08-25

In [75]:
df[2:5]

   Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_nac
2    Lucy     Chow chow    Café         46       24  2014-08-25
3  Cooper     Schnauzer    Gris         49       17  2011-12-11
4  Bernie  San Bernando  Blanco         77       74  2018-02-27

In [76]:
df[:]

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_nac
0    Bella      Labrador    Café         56       24  2013-07-01
1  Charlie        Poodle   Negro         43       24  2016-09-16
2     Lucy     Chow chow    Café         46       24  2014-08-25
3   Cooper     Schnauzer    Gris         49       17  2011-12-11
4   Bernie  San Bernando  Blanco         77       74  2018-02-27
5      Max     Chow chow  Blanco         45       28  2019-03-27
6     Reed     Schnauzer   Negro         45       15  2017-09-18

In [77]:
df_ind2=df_ind2.sort_index(level='Raza', ascending=True)
df_ind2

                      Nombre  Altura_cm  Peso_kg   Fecha_nac
Raza         Color
Chow chow    Blanco      Max         45       28  2019-03-27
             Café       Lucy         46       24  2014-08-25
Labrador     Café      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
San Bernando Blanco   Bernie         77       74  2018-02-27
Schnauzer    Gris     Cooper         49       17  2011-12-11
             Negro      Reed         45       15  2017-09-18

In [78]:
df_ind2.loc['Chow chow':'Labrador']

                 Nombre  Altura_cm  Peso_kg   Fecha_nac
Raza      Color
Chow chow Blanco    Max         45       28  2019-03-27
          Café     Lucy         46       24  2014-08-25
Labrador  Café    Bella         56       24  2013-07-01

In [79]:
# creacion de una tabla pivote
df_altura_raza_color = df.pivot_table('Altura_cm', index='Raza', columns='Color')
df_altura_raza_color

Color         Blanco  Café  Gris  Negro
Raza
Chow chow       45.0  46.0   NaN    NaN
Labrador         NaN  56.0   NaN    NaN
Poodle           NaN   NaN   NaN   43.0
San Bernando    77.0   NaN   NaN    NaN
Schnauzer        NaN   NaN  49.0   45.0

In [80]:
# calculo promedio de todos los renglones por columna
df_altura_raza_color.mean(axis='index')

Color
Blanco    61.0
Café      51.0
Gris      49.0
Negro     44.0
dtype: float64

In [81]:
df_altura_raza_color.mean(axis='columns')

Raza
Chow chow       45.5
Labrador        56.0
Poodle          43.0
San Bernando    77.0
Schnauzer       47.0
dtype: float64